benchmark/5_Cache_GET_without_writes/RENDER/GET_cache/get_50conn_10s_20250516_144417.txt
Running 10s test @ https://url-shortener-pbhq.onrender.com
  50 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   307.22ms   88.22ms 634.15ms   61.88%
    Req/Sec     3.22      1.28    10.00     69.82%
  1574 requests in 10.10s, 782.44KB read
Requests/sec:    155.84
Transfer/sec:     77.47KB